app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "hello"], ["category", "test"], ["updated_at", "2020-06-18 04:20:01.617197"], ["id", 1]]
---
def update
  blog = Blog.find(params[:id])
  blog.update(blog_params)